In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.DataFrame()

In [3]:
df

Empty DataFrame
Columns: []
Index: []

In [4]:
print(df)

Empty DataFrame
Columns: []
Index: []

In [5]:
df1 = pd.DataFrame([[1,2,3,4],[5,6,7,8],[2,7,3,23],[3,6,8,23],[23,23,63,12]])

In [6]:
print(df1)

    0   1   2   3
0   1   2   3   4
1   5   6   7   8
2   2   7   3  23
3   3   6   8  23
4  23  23  63  12

In [7]:
df1

    0   1   2   3
0   1   2   3   4
1   5   6   7   8
2   2   7   3  23
3   3   6   8  23
4  23  23  63  12

In [8]:
df1.head(3)

   0  1  2   3
0  1  2  3   4
1  5  6  7   8
2  2  7  3  23

In [9]:
df1.tail(3)

    0   1   2   3
2   2   7   3  23
3   3   6   8  23
4  23  23  63  12

In [10]:
df1

    0   1   2   3
0   1   2   3   4
1   5   6   7   8
2   2   7   3  23
3   3   6   8  23
4  23  23  63  12

In [11]:
df1.shape

(5, 4)

In [12]:
df1.iloc[0,1]

2

In [13]:
df1.iloc[0:2,1:3]

   1  2
0  2  3
1  6  7

In [14]:
df1 = pd.DataFrame([[1,2,3,4],[5,6,7,8],[2,7,3,23],[3,6,8,23],[23,23,63,12]],columns=['A','B','C','D'])
df1

    A   B   C   D
0   1   2   3   4
1   5   6   7   8
2   2   7   3  23
3   3   6   8  23
4  23  23  63  12